import enum

class JCZError(enum.Enum):
    E00 = (0, "函数运行成功", "")
    E01 = (1, "发现EZCAD在运行", "关闭原先运行程序，在运行")
    E02 = (2, "找不到EZCAD.CFG", "启动标准软件，将其目录下的EZCAD.CFG文件复制到开发程序目录下，与开发程序.exe同目录。")
    E03 = (3, "打开LMC1失败", "")
    E04 = (4, "没有有效的lmc1设备", "确认硬件设备无误")
    E05 = (5, "lmc1版本错误", "检查板卡版本与开发库版本是否匹配")
    E06 = (6, "找不到设备配置文件", "启动标准软件，将其目录下的一些配置文件复制到开发程序目录下，与开发程序.exe同目录。")
    E07 = (7, "报警信号", "")
    E08 = (8, "用户停止", "")
    E09 = (9, "不明错误", "")
    E10 = (10, "超时", "")
    E11 = (11, "未初始化", "板卡未初始化")
    E12 = (12, "读文件错误", "")
    E13 = (13, "窗口为空", "")
    E14 = (14, "找不到指定名称的字体", "")
    E15 = (15, "错误的笔号", "")
    E16 = (16, "指定名称的对象不是文本对象", "")
    E17 = (17, "保存文件失败", "检查保存路径完整性")
    E18 = (18, "找不到指定对象", "")
    E19 = (19, "当前状态下不能执行此操作", "")
    E20 = (20, "错误的执行参数", "")
    E21 = (21, "错误的硬件参数", "板卡与开发库版本不匹配，板卡未写入开发库支持功能，联系销售")

    def __init__(self, code, desc, solution):
        self.code = code
        self.desc = desc
        self.solution = solution


JCZErrorList = list(JCZError)
